<?xml version="1.0" ?>
<net name="vd-net-caffe" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,384,672"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_1051510519/copy_const510_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Mul_/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_1051610521/copy_const512_const" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="1,3,1,1" size="12"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Add_/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="23012305_const" type="Const" version="opset1">
			<data element_type="f32" offset="16" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="23022306_const" type="Const" version="opset1">
			<data element_type="f32" offset="20" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="23032307_const" type="Const" version="opset1">
			<data element_type="f32" offset="16" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="23042308_const" type="Const" version="opset1">
			<data element_type="f32" offset="20" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="conv1/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Mul1_/Fused_Mul_1130211304_const514_const" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="32,3,3,3" size="3456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="23112315_const" type="Const" version="opset1">
			<data element_type="f32" offset="3480" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="23122316_const" type="Const" version="opset1">
			<data element_type="f32" offset="3608" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="23132317_const" type="Const" version="opset1">
			<data element_type="f32" offset="3736" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="23142318_const" type="Const" version="opset1">
			<data element_type="f32" offset="3864" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv1/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv1" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="data_add_1052410529/copy_const516_const" type="Const" version="opset1">
			<data element_type="f32" offset="3992" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Add1_/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="relu1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="21012105_const" type="Const" version="opset1">
			<data element_type="f32" offset="4120" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="21022106_const" type="Const" version="opset1">
			<data element_type="f32" offset="4248" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="21032107_const" type="Const" version="opset1">
			<data element_type="f32" offset="4120" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="21042108_const" type="Const" version="opset1">
			<data element_type="f32" offset="4248" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv2_1/dw/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="1150982_const" type="Const" version="opset1">
			<data element_type="f32" offset="4376" shape="32,1,3,3" size="1152"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="21112115_const" type="Const" version="opset1">
			<data element_type="f32" offset="5528" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="21122116_const" type="Const" version="opset1">
			<data element_type="f32" offset="5656" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="21132117_const" type="Const" version="opset1">
			<data element_type="f32" offset="5528" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="21142118_const" type="Const" version="opset1">
			<data element_type="f32" offset="5656" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv2_1/dw/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="4434/value4436_const" type="Const" version="opset1">
			<data element_type="i64" offset="5784" shape="5" size="40"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="4434" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv2_1/dw" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="data_add_1053210537/copy_const521_const" type="Const" version="opset1">
			<data element_type="f32" offset="5824" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Add1_9220/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="relu2_1/dw" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="24012405_const" type="Const" version="opset1">
			<data element_type="f32" offset="5952" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="24022406_const" type="Const" version="opset1">
			<data element_type="f32" offset="5956" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="24032407_const" type="Const" version="opset1">
			<data element_type="f32" offset="5952" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="24042408_const" type="Const" version="opset1">
			<data element_type="f32" offset="5956" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="conv2_1/sep/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Mul1_9231/Fused_Mul_1131011312_const524_const" type="Const" version="opset1">
			<data element_type="f32" offset="5960" shape="56,32,1,1" size="7168"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="24112415_const" type="Const" version="opset1">
			<data element_type="f32" offset="13128" shape="56,1,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="24122416_const" type="Const" version="opset1">
			<data element_type="f32" offset="13352" shape="56,1,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="24132417_const" type="Const" version="opset1">
			<data element_type="f32" offset="13128" shape="56,1,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="24142418_const" type="Const" version="opset1">
			<data element_type="f32" offset="13352" shape="56,1,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv2_1/sep/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>56</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>56</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv2_1/sep" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1">
					<dim>56</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="data_add_1054010545/copy_const526_const" type="Const" version="opset1">
			<data element_type="f32" offset="13576" shape="1,56,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Add1_9232/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="relu2_1/sep" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="21812185_const" type="Const" version="opset1">
			<data element_type="f32" offset="13800" shape="1,56,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="21822186_const" type="Const" version="opset1">
			<data element_type="f32" offset="14024" shape="1,56,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="21832187_const" type="Const" version="opset1">
			<data element_type="f32" offset="13800" shape="1,56,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="21842188_const" type="Const" version="opset1">
			<data element_type="f32" offset="14024" shape="1,56,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv2_2/dw/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="1154984_const" type="Const" version="opset1">
			<data element_type="f32" offset="14248" shape="56,1,3,3" size="2016"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="21912195_const" type="Const" version="opset1">
			<data element_type="f32" offset="16264" shape="56,1,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="21922196_const" type="Const" version="opset1">
			<data element_type="f32" offset="16488" shape="56,1,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="21932197_const" type="Const" version="opset1">
			<data element_type="f32" offset="16264" shape="56,1,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="21942198_const" type="Const" version="opset1">
			<data element_type="f32" offset="16488" shape="56,1,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="conv2_2/dw/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>56</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="4438/value4440_const" type="Const" version="opset1">
			<data element_type="i64" offset="16712" shape="5" size="40"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="4438" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>56</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv2_2/dw" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="data_add_1054810553/copy_const531_const" type="Const" version="opset1">
			<data element_type="f32" offset="16752" shape="1,56,1,1" size="224"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Add1_9244/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="relu2_2/dw" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="15211525_const" type="Const" version="opset1">
			<data element_type="f32" offset="5952" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="15221526_const" type="Const" version="opset1">
			<data element_type="f32" offset="16976" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="71" name="15231527_const" type="Const" version="opset1">
			<data element_type="f32" offset="5952" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="72" name="15241528_const" type="Const" version="opset1">
			<data element_type="f32" offset="16976" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="73" name="conv2_2/sep/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Mul1_9255/Fused_Mul_1131811320_const534_const" type="Const" version="opset1">
			<data element_type="f32" offset="16980" shape="112,56,1,1" size="25088"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="15311535_const" type="Const" version="opset1">
			<data element_type="f32" offset="42068" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="15321536_const" type="Const" version="opset1">
			<data element_type="f32" offset="42516" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="15331537_const" type="Const" version="opset1">
			<data element_type="f32" offset="42068" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="15341538_const" type="Const" version="opset1">
			<data element_type="f32" offset="42516" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv2_2/sep/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>112</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>112</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv2_2/sep" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_1055610561/copy_const536_const" type="Const" version="opset1">
			<data element_type="f32" offset="42964" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Add1_9256/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="relu2_2/sep" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="18211825_const" type="Const" version="opset1">
			<data element_type="f32" offset="43412" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="18221826_const" type="Const" version="opset1">
			<data element_type="f32" offset="43860" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="18231827_const" type="Const" version="opset1">
			<data element_type="f32" offset="43412" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="18241828_const" type="Const" version="opset1">
			<data element_type="f32" offset="43860" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv3_1/dw/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="1158986_const" type="Const" version="opset1">
			<data element_type="f32" offset="44308" shape="112,1,3,3" size="4032"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="18311835_const" type="Const" version="opset1">
			<data element_type="f32" offset="48340" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="18321836_const" type="Const" version="opset1">
			<data element_type="f32" offset="48788" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="18331837_const" type="Const" version="opset1">
			<data element_type="f32" offset="48340" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="18341838_const" type="Const" version="opset1">
			<data element_type="f32" offset="48788" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="conv3_1/dw/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>112</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="4450/value4452_const" type="Const" version="opset1">
			<data element_type="i64" offset="49236" shape="5" size="40"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="4450" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>112</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="conv3_1/dw" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="data_add_1056410569/copy_const541_const" type="Const" version="opset1">
			<data element_type="f32" offset="49276" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Add1_9268/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="relu3_1/dw" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="22612265_const" type="Const" version="opset1">
			<data element_type="f32" offset="5952" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="22622266_const" type="Const" version="opset1">
			<data element_type="f32" offset="49724" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="22632267_const" type="Const" version="opset1">
			<data element_type="f32" offset="5952" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="22642268_const" type="Const" version="opset1">
			<data element_type="f32" offset="49724" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="conv3_1/sep/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Mul1_9279/Fused_Mul_1132611328_const544_const" type="Const" version="opset1">
			<data element_type="f32" offset="49728" shape="112,112,1,1" size="50176"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="22712275_const" type="Const" version="opset1">
			<data element_type="f32" offset="99904" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="22722276_const" type="Const" version="opset1">
			<data element_type="f32" offset="100352" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="22732277_const" type="Const" version="opset1">
			<data element_type="f32" offset="99904" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="22742278_const" type="Const" version="opset1">
			<data element_type="f32" offset="100352" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="conv3_1/sep/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="conv3_1/sep" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="data_add_1057210577/copy_const546_const" type="Const" version="opset1">
			<data element_type="f32" offset="100800" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Add1_9280/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="relu3_1/sep" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="17411745_const" type="Const" version="opset1">
			<data element_type="f32" offset="43412" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="17421746_const" type="Const" version="opset1">
			<data element_type="f32" offset="101248" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="17431747_const" type="Const" version="opset1">
			<data element_type="f32" offset="43412" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="17441748_const" type="Const" version="opset1">
			<data element_type="f32" offset="101248" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="conv3_2/dw/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="1162988_const" type="Const" version="opset1">
			<data element_type="f32" offset="101696" shape="112,1,3,3" size="4032"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="17511755_const" type="Const" version="opset1">
			<data element_type="f32" offset="105728" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="17521756_const" type="Const" version="opset1">
			<data element_type="f32" offset="106176" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="17531757_const" type="Const" version="opset1">
			<data element_type="f32" offset="105728" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="17541758_const" type="Const" version="opset1">
			<data element_type="f32" offset="106176" shape="112,1,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="conv3_2/dw/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>112</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="4426/value4428_const" type="Const" version="opset1">
			<data element_type="i64" offset="49236" shape="5" size="40"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="4426" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>112</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="conv3_2/dw" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="data_add_1058010585/copy_const551_const" type="Const" version="opset1">
			<data element_type="f32" offset="106624" shape="1,112,1,1" size="448"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Add1_9292/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="relu3_2/dw" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
